kAllSegmentsOutsideOddWinds
The clipped polygon is outside the clip region, and the clip region is encircled by the clipped polygon an odd number of times.
This normally indicates that the clip region is inside the region enclosed by the input polygon.